/*1. Дано натуральное число N (2<=N<=1000). Определите рекурсивно, является ли оно простым.
  2.Реализуйте быструю сортировку. Изучите, как она работает. Сравните скорость работы с сортировкой обменами.
  3.Вам дано поле размерами NхM (2<=N,M<=100). В каждой клетке поля находятся символы:
‘.’ - можно пройти;
‘#’ - нельзя пройти;
‘S’ - начальная клетка;
‘E’ - конечная клетка;
Напишите алгоритм, который определит минимальное количество шагов для перемещения из начальной клетки в конечную.
Если это сделать невозможно, выведите -1. Ходить во все соседние клетки, которые отмечены ‘.’ (в том числе и по диагонали).*/
